from math import sqrt
'''
接触力、接触时间、接触做功
'''

E1 = 140 * 1e6  # 弹性模量假设，Pa
E2 = 140 * 1e6
v1 = 0.4  # 泊松比假设，无量纲
v2 = 0.4
R = 0.1  # 排球半径约为 0.1m
d = 0.005  # 凹陷深度，5mm

_E = 1 / ((1-v1**2)/E1 + (1-v2**2)/E2)

F = 4/3 * _E * sqrt(R) * (d ** 1.5)

print('_E=', _E)
print('受力大小=', F)

####

print('##############')

g = 9.8
h = 0.4  # 下落高度
t = sqrt(h * 2 / g)
v = g * t
print('下落时间:', t, '撞击时速度：', v)
print('假设周期性运动，接触时间不计，球体再次向上运动时速度等于下落速度')
m_ball = 0.27
mv = m_ball * 2 * v  # 只有大小，方向向上
print('排球受到的冲量:', mv)
t_strike = 0.05  # 假设测量到撞击时间为0.05s
print('接触时间:', t_strike)
print('接触过程中的平均力:', mv / t_strike)

#### 鼓球撞击的能量损失

#### 鼓的速度

'''
最佳策略：（只考虑鼓球模型）更省力的颠球方式【鼓在上升期自由下落】
'''

v_drum_up = 0.2  # 假设鼓撞击结束后，上升速度是0.2m/s
t_hori = 2 * v_drum_up / g
print(t_hori)



# print()



